ddd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-05-25 jue 17:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Notes on DDD</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="mikel" />
</head>
<body>
<div id="content">
<h1 class="title">Notes on DDD</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga6d1b64">1. Services</a>
<ul>
<li><a href="#org882a6db">1.1. Application services</a></li>
<li><a href="#org11dbf31">1.2. Infrastructure services</a></li>
<li><a href="#org24a180b">1.3. Sources</a></li>
</ul>
</li>
<li><a href="#org97c2c8a">2. Model-Driven Design</a>
<ul>
<li><a href="#orgdd4d78e">2.1. Sources</a></li>
</ul>
</li>
<li><a href="#orgea362b7">3. Domain Events</a>
<ul>
<li><a href="#orgd9435e5">3.1. Sources</a></li>
</ul>
</li>
<li><a href="#org3e9d69b">4. Entities</a>
<ul>
<li><a href="#orgcc15544">4.1. Sources</a></li>
</ul>
</li>
<li><a href="#org44edf8a">5. Repositories</a>
<ul>
<li><a href="#orgb8d5122">5.1. Sources</a></li>
</ul>
</li>
<li><a href="#org9248726">6. Aggregates</a>
<ul>
<li><a href="#org0719b4c">6.1. Aggregate root</a></li>
<li><a href="#orga033a14">6.2. Sources</a></li>
</ul>
</li>
<li><a href="#orga60e8ae">7. Factories</a>
<ul>
<li><a href="#org66ade49">7.1. Sources</a></li>
</ul>
</li>
<li><a href="#org8b22b37">8. Value Objects</a>
<ul>
<li><a href="#org129d783">8.1. Sources</a></li>
</ul>
</li>
<li><a href="#org08ac3e0">9. Layered Architecture</a>
<ul>
<li><a href="#org00d8b41">9.1. Sources</a></li>
</ul>
</li>
<li><a href="#orga39fb71">10. Ubiquitous Language</a>
<ul>
<li><a href="#orgd334215">10.1. Sources</a></li>
</ul>
</li>
<li><a href="#org9ba1ed6">11. Core Domain</a>
<ul>
<li><a href="#orgbbe87ce">11.1. Domain</a></li>
<li><a href="#orgaf4d504">11.2. Subdomain</a></li>
<li><a href="#org0f69c75">11.3. Core domain</a></li>
<li><a href="#org6dd6554">11.4. Supporting subdomain</a></li>
<li><a href="#org630e9c8">11.5. Generic subdomain</a></li>
<li><a href="#orgf4e7f83">11.6. Problem space</a></li>
<li><a href="#org5c81d77">11.7. Solution space</a></li>
<li><a href="#org37ff1a5">11.8. Red book example</a></li>
<li><a href="#org29525a3">11.9. Sources</a></li>
</ul>
</li>
<li><a href="#org7dffaf8">12. Generic subdomains</a></li>
<li><a href="#org62938a8">13. Bounded Context</a>
<ul>
<li><a href="#orgbf97984">13.1. Open Host Service</a></li>
<li><a href="#orgd72e985">13.2. Published Language</a></li>
<li><a href="#org3b994e6">13.3. Sources</a></li>
</ul>
</li>
<li><a href="#org72af20e">14. Continuous Integration</a>
<ul>
<li><a href="#orgb3d5e58">14.1. Sources:</a></li>
</ul>
</li>
<li><a href="#org3d708fc">15. Context Map</a>
<ul>
<li><a href="#org81a3ba8">15.1. Team Relationships</a></li>
<li><a href="#orgdd8ef72">15.2. Context Map patterns</a></li>
<li><a href="#org9897225">15.3. Sources</a></li>
</ul>
</li>
<li><a href="#org7497e97">16. Shared Kernel</a></li>
<li><a href="#org230ea02">17. Customer / Supplier</a></li>
<li><a href="#org428c165">18. Conformist</a></li>
<li><a href="#org3fe615a">19. Open Host Service</a></li>
<li><a href="#org0e29e4e">20. Published Language</a></li>
<li><a href="#org3fad7f2">21. Separate Ways</a></li>
<li><a href="#org64b74ca">22. Anti-Corruption Layer</a></li>
<li><a href="#org48f2f6a">23. Big Ball of Mud</a></li>
</ul>
</div>
</div>
<div id="outline-container-orga6d1b64" class="outline-2">
<h2 id="orga6d1b64"><span class="section-number-2">1</span> Services</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org882a6db" class="outline-3">
<h3 id="org882a6db"><span class="section-number-3">1.1</span> Application services</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Services in the application layer are responsible for fetching input data from outside of the domain, returns information about a result of the action, listens for an answer and decides if the communicational message should be sent.
</p>
</div>
</div>
<div id="outline-container-org11dbf31" class="outline-3">
<h3 id="org11dbf31"><span class="section-number-3">1.2</span> Infrastructure services</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Services in the infrastructure layer are services which implement an interface from the domain layer. A good example is a notification service. In the domain layer, you define an interface with actions we want to have eg sendEmailAboutLoan and in this layer we implement it.
</p>

<p>
This is a place where you implement repositories or anything that depends on libraries we use in the program.
</p>
</div>
</div>

<div id="outline-container-org24a180b" class="outline-3">
<h3 id="org24a180b"><span class="section-number-3">1.3</span> Sources</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li><a href="https://developer20.com/services-in-ddd-finally-explained/">https://developer20.com/services-in-ddd-finally-explained/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org97c2c8a" class="outline-2">
<h2 id="org97c2c8a"><span class="section-number-2">2</span> Model-Driven Design</h2>
<div class="outline-text-2" id="text-2">
<p>
There are many views on what Model Driven Design (henceforth MDD) is and what a Model Driven Architecture (henceforth MDA) should look like.
</p>

<p>
Basically, MDA uses models to describe the business (functionality) of the solution, independent of any system constraints (software oriented decisions).
</p>

<p>
In MDA, "platform-independent models are initially expressed in a platform-independent modeling language". In short, the model is described according to specification, independent from the programming language in which it will be transformed. The result source code will be described at the time with the model or after the model is finished, but the model will always have priority.
</p>
</div>

<div id="outline-container-orgdd4d78e" class="outline-3">
<h3 id="orgdd4d78e"><span class="section-number-3">2.1</span> Sources</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://todaysoftmag.com/article/1529/model-driven-design-theory-to-practice">https://todaysoftmag.com/article/1529/model-driven-design-theory-to-practice</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgea362b7" class="outline-2">
<h2 id="orgea362b7"><span class="section-number-2">3</span> Domain Events</h2>
<div class="outline-text-2" id="text-3">
<p>
A domain event is, something that happened in the domain that you want other parts of the same domain (in-process) to be aware of. The notified parts usually react somehow to the events.
</p>

<p>
An important benefit of domain events is that side effects can be expressed explicitly.
</p>
</div>

<div id="outline-container-orgd9435e5" class="outline-3">
<h3 id="orgd9435e5"><span class="section-number-3">3.1</span> Sources</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="https://learn.microsoft.com/en-us/dotnet/architecture/microservices/microservice-ddd-cqrs-patterns/domain-events-design-implementation">https://learn.microsoft.com/en-us/dotnet/architecture/microservices/microservice-ddd-cqrs-patterns/domain-events-design-implementation</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3e9d69b" class="outline-2">
<h2 id="org3e9d69b"><span class="section-number-2">4</span> Entities</h2>
<div class="outline-text-2" id="text-4">
<p>
An object primarily defined by its identity is called an Entity.
</p>

<p>
When you think of an Entity, imagine something that needs to be tracked over time and whose attributes are likely to change over time.
</p>

<p>
A very strong indicator for something being an Entity is something like a status attribute (like pending, active, or inactive) or attribute prefixes like current or last.
</p>

<p>
A requirement like "The object should be the same if the attributes are the same." is a strong indicator that it is probably not an Entity at all.
</p>
</div>

<div id="outline-container-orgcc15544" class="outline-3">
<h3 id="orgcc15544"><span class="section-number-3">4.1</span> Sources</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li><a href="https://blog.jannikwempe.com/domain-driven-design-entities-value-objects#heading-entities">https://blog.jannikwempe.com/domain-driven-design-entities-value-objects#heading-entities</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org44edf8a" class="outline-2">
<h2 id="org44edf8a"><span class="section-number-2">5</span> Repositories</h2>
<div class="outline-text-2" id="text-5">
<p>
Repository implementations are classes that encapsulate the logic required to access data sources. They centralize common data access functionality, providing better maintainability and decoupling the infrastructure or technology used to access databases from the domain model. If you use an Object-Relational Mapper (ORM) like Entity Framework, the code that must be implemented is simplified, thanks to LINQ and strong typing. This lets you focus on the data persistence logic rather than on data access plumbing.
</p>

<p>
A repository performs the tasks of an intermediary between the domain model layers and data mapping, acting in a similar way to a set of domain objects in memory. Client objects declaratively build queries and send them to the repositories for answers. Conceptually, a repository encapsulates a set of objects stored in the database and operations that can be performed on them, providing a way that is closer to the persistence layer. Repositories, also, support the purpose of separating, clearly and in one direction, the dependency between the work domain and the data allocation or mapping.
</p>
</div>
<div id="outline-container-orgb8d5122" class="outline-3">
<h3 id="orgb8d5122"><span class="section-number-3">5.1</span> Sources</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li><a href="https://learn.microsoft.com/en-us/dotnet/architecture/microservices/microservice-ddd-cqrs-patterns/infrastructure-persistence-layer-design">https://learn.microsoft.com/en-us/dotnet/architecture/microservices/microservice-ddd-cqrs-patterns/infrastructure-persistence-layer-design</a></li>
<li><a href="https://www.amazon.com/Patterns-Enterprise-Application-Architecture-Martin/dp/0321127420/">https://www.amazon.com/Patterns-Enterprise-Application-Architecture-Martin/dp/0321127420/</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org9248726" class="outline-2">
<h2 id="org9248726"><span class="section-number-2">6</span> Aggregates</h2>
<div class="outline-text-2" id="text-6">
<p>
A DDD aggregate is a cluster of domain objects that can be treated as a single unit. An example may be an order and its line-items, these will be separate objects, but it's useful to treat the order (together with its line items) as a single aggregate.
</p>
</div>
