ddd.html
<div id="outline-container-org0719b4c" class="outline-3">
<h3 id="org0719b4c"><span class="section-number-3">6.1</span> Aggregate root</h3>
<div class="outline-text-3" id="text-6-1">
<p>
An aggregate will have one of its component objects be the aggregate root. Any references from outside the aggregate should only go to the aggregate root. The root can thus ensure the integrity of the aggregate as a whole.
</p>

<p>
In addition to controlling access, the aggregate root is also responsible for ensuring the consistency of the aggregate. This is why it is important to ensure that the aggregate root does not directly expose its children, but rather controls access itself.
</p>

<p>
As an example, consider an e-commerce domain which has concepts for Orders, which have multiple OrderItems, each of which refers to some quantity of Products being purchased. Adding and removing items to an Order should be controlled by the Order - parts of the application shouldn't be able to reach out and create an individual OrderItem as part of an Order without going through the Order. Deleting an Order should delete all of the OrderItems that are associated with it. So, Order makes sense as an aggregate root for the Order - OrderItem group.
</p>
</div>
</div>
<div id="outline-container-orga033a14" class="outline-3">
<h3 id="orga033a14"><span class="section-number-3">6.2</span> Sources</h3>
<div class="outline-text-3" id="text-6-2">
<ul class="org-ul">
<li><a href="https://martinfowler.com/bliki/DDD_Aggregate.html">https://martinfowler.com/bliki/DDD_Aggregate.html</a></li>
<li><a href="https://deviq.com/domain-driven-design/aggregate-pattern">https://deviq.com/domain-driven-design/aggregate-pattern</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga60e8ae" class="outline-2">
<h2 id="orga60e8ae"><span class="section-number-2">7</span> Factories</h2>
<div class="outline-text-2" id="text-7">
<p>
A Factory is an object that has the single responsibility of creating other objects.
</p>

<p>
A Factory encapsulates the knowledge needed to create a complex object or Aggregate. The Factory needs to know a lot about the internal structure and dependencies of the object, but the Factory will shield this complexity from the outside world by providing an interface that reflects the goals of the client and an abstract view of the created object.
</p>
</div>
<div id="outline-container-org66ade49" class="outline-3">
<h3 id="org66ade49"><span class="section-number-3">7.1</span> Sources</h3>
<div class="outline-text-3" id="text-7-1">
<ul class="org-ul">
<li><a href="https://culttt.com/2014/12/24/factories-domain-driven-design#what-is-a-factory">https://culttt.com/2014/12/24/factories-domain-driven-design#what-is-a-factory</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org8b22b37" class="outline-2">
<h2 id="org8b22b37"><span class="section-number-2">8</span> Value Objects</h2>
<div class="outline-text-2" id="text-8">
<p>
A value object is a small object that represents a simple entity whose equality is not based on identity: i.e. two value objects are equal when they have the same value, not necessarily being the same object.
</p>

<p>
Examples of value objects are objects representing an amount of money or a date range.
</p>
</div>
<div id="outline-container-org129d783" class="outline-3">
<h3 id="org129d783"><span class="section-number-3">8.1</span> Sources</h3>
<div class="outline-text-3" id="text-8-1">
<ul class="org-ul">
<li><a href="https://en.wikipedia.org/wiki/Value_object">https://en.wikipedia.org/wiki/Value_object</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org08ac3e0" class="outline-2">
<h2 id="org08ac3e0"><span class="section-number-2">9</span> Layered Architecture</h2>
<div class="outline-text-2" id="text-9">
<p>
A standard layered architecture has five parts:
</p>

<ul class="org-ul">
<li>User interaction layer: This is the layer that interacts with users through screens, forms, menus, reports, etc. It is the most visible layer of the application. It defines how the application looks.</li>

<li>Functionality layer: This is the layer that presents the functions, methods, and procedures of the system based on the business rules layer. It determines how the pull-down menus work, how the buttons work, and how the system navigates through screens.</li>

<li>Business rules layer: This layer contains rules that determine the behavior of the whole application, such as, “If an invoice is printed, then send an email to the customer, select all items sold, and decrease their stock in the stock management module.”</li>

<li>Application core layer: This server contains the main programs, code definitions, and basic functions of the application. Programmers work in this layer most of the time.</li>

<li>Database layer: This layer contains the tables, indexes, and data managed by the application. Searches and insert/delete/update operations are executed here.</li>
</ul>

<p>
An ERP System (accounts payable, accounts receivable, stock management, HR management, production management, provider management, purchasing, treasury, finance, accounting, etc.) has a user interaction layer for each module: screens, forms, menus, reports. This is what the user sees and what they use.  
</p>

<p>
The functionality layer navigates through the different modules, presents screen sequences to the user, and does all data input operations. 
</p>

<p>
The business rules layer determines the behavior of the modules of the ERP: “If a new employee is entered into the HR and payroll modules, then insert an introductory course in the employee's training menu.”
</p>

<p>
The application core layer is the place where all system code is located. This is where developers add customizations and new functionalities.
</p>

<p>
The database layer contains the tables, indexes, and data managed by each of the modules.
</p>
</div>
<div id="outline-container-org00d8b41" class="outline-3">
<h3 id="org00d8b41"><span class="section-number-3">9.1</span> Sources</h3>
<div class="outline-text-3" id="text-9-1">
<ul class="org-ul">
<li><a href="https://openclassrooms.com/en/courses/6397806-design-your-software-architecture-using-industry-standard-patterns/6896176-layered-architecture">https://openclassrooms.com/en/courses/6397806-design-your-software-architecture-using-industry-standard-patterns/6896176-layered-architecture</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orga39fb71" class="outline-2">
<h2 id="orga39fb71"><span class="section-number-2">10</span> Ubiquitous Language</h2>
<div class="outline-text-2" id="text-10">
<p>
Ubiquitous Language is the term Eric Evans uses in Domain Driven Design for the practice of building up a common, rigorous language between developers and users. This language should be based on the Domain Model used in the software - hence the need for it to be rigorous, since software doesn't cope well with ambiguity.
</p>

<p>
Evans makes clear that using the ubiquitous language in conversations with domain experts is an important part of testing it, and hence the domain model. He also stresses that the language (and model) should evolve as the team's understanding of the domain grows.
</p>
</div>
<div id="outline-container-orgd334215" class="outline-3">
<h3 id="orgd334215"><span class="section-number-3">10.1</span> Sources</h3>
<div class="outline-text-3" id="text-10-1">
<p>
<a href="https://martinfowler.com/bliki/UbiquitousLanguage.html">https://martinfowler.com/bliki/UbiquitousLanguage.html</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org9ba1ed6" class="outline-2">
<h2 id="org9ba1ed6"><span class="section-number-2">11</span> Core Domain</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-orgbbe87ce" class="outline-3">
<h3 id="orgbbe87ce"><span class="section-number-3">11.1</span> Domain</h3>
<div class="outline-text-3" id="text-11-1">
<p>
The Domain is what an organization does and the environment in which it operates. A software developer working for an organization must work within its domain. 
</p>
</div>
</div>
<div id="outline-container-orgaf4d504" class="outline-3">
<h3 id="orgaf4d504"><span class="section-number-3">11.2</span> Subdomain</h3>
<div class="outline-text-3" id="text-11-2">
<p>
It is important to understand that when developing a model of the domain, it is necessary to focus on a specific subdomain, as it is almost impossible to create a single, all-encompassing business model even for moderately complex organizations. It is very important to divide models into logically separated subdomains according to their actual functionality. Subdomains allow different parts of the domain necessary to solve a particular problem to be identified more quickly.
</p>
</div>
</div>
<div id="outline-container-org0f69c75" class="outline-3">
<h3 id="org0f69c75"><span class="section-number-3">11.3</span> Core domain</h3>
<div class="outline-text-3" id="text-11-3">
<p>
The Core domain is a subdomain that has primary importance for the organization.
</p>
</div>
</div>
<div id="outline-container-org6dd6554" class="outline-3">
<h3 id="org6dd6554"><span class="section-number-3">11.4</span> Supporting subdomain</h3>
<div class="outline-text-3" id="text-11-4">
<p>
If a specific aspect of the business is being modeled that is important but not part of the Core domain, then it belongs to the Supporting subdomain. The business creates a Supporting subdomain because it has a specialization.
</p>
</div>
</div>
