ddd.org
** Generic subdomain
If it does not have a specific purpose for the business and is required for the entire business as a whole, then it is called a Generic subdomain. These types of subdomains are important for business success, but they are not of primary importance. It is the Core domain that must be implemented perfectly, as it provides a business advantage.
** Problem space
The problem space is a part of the subject area that is necessary to create the core meaning. It is a combination of the core meaning and sub-domains that this core should use.
** Solution space
The solution space is one or several limited contexts, a set of specific software models. The developed limited context is a specific solution, a representation of implementation.
** Red book example
In Vernon’s book, an example is given of a core concept for a small retail company that operates online. Any online store can improve its position by using a forecasting mechanism that analyzes sales history and inventory data to predict demand and determine optimal inventory levels. (The company should not waste money on products that have no demand and take up additional warehouse space.) It is this core concept that makes the organization much more competitive, able to quickly identify profitable deals and guarantee the necessary inventory levels. The problem space consists of the core concept and subdomains related to procurement and inventory.
** Sources
https://levelup.gitconnected.com/domain-and-core-domain-in-ddd-c49733fa8c74
* Generic subdomains
* Bounded Context
 A bounded context is simply the boundary within a domain where a particular domain model applies.
** Open Host Service
The idea of Open Host Service is that a subsystem defines a formal protocol (API) for other subsystems to communicate with it.
** Published Language 
It extends Open Host Service by publishing the API in a form that other teams can use to write clients.
** Sources
- https://learn.microsoft.com/en-us/azure/architecture/microservices/model/domain-analysis
* Continuous Integration
When a number of people are working in the same bounded context there is a strong tendency for the model to fragment. The bigger the team, the bigger the problem, but as few as three or four people can encounter serious problems. Yet breaking down the system into ever-smaller contexts eventually loses a valuable level of integration and coherency.

Therefore:

Institute a process of merging all code and other implementation artifacts frequently, with automated tests to flag fragmentation quickly. Relentlessly exercise the ubiquitous language to hammer out a shared view of the model as the concepts evolve in different people's heads.
** Sources:
- http://ddd.fed.wiki.org/view/continuous-integration
* Context Map
Context Maps describe the contact between bounded contexts and teams with a collection of patterns. There are nine context map patterns and three different team relationships. The context map patterns describe a variety of perspectives like service provisioning, model propagation or governance aspects. This diversity of perspectives enables you to get a holistic overview of team and bounded context relationships.

Context Maps can be used to analyze existing systems or application landscapes, but they are also suitable for upfront design considerations.
** Team Relationships
- Mutually Dependent
- Upstream Downstream
- Free
** Context Map patterns
- Open-host Service
- Conformist
- Anticorruption Layer
- Shared Kernel
- Partnership
- Customer / Supplier development
- Published language
- Separate Ways
- Big Ball Of Mud
** Sources
- https://github.com/ddd-crew/context-mappinghttps://github.com/ddd-crew/context-mapping
* Shared Kernel
* Customer / Supplier
* Conformist
* Open Host Service
* Published Language
* Separate Ways
* Anti-Corruption Layer
* Big Ball of Mud
