ddd.html
<div id="outline-container-org630e9c8" class="outline-3">
<h3 id="org630e9c8"><span class="section-number-3">11.5</span> Generic subdomain</h3>
<div class="outline-text-3" id="text-11-5">
<p>
If it does not have a specific purpose for the business and is required for the entire business as a whole, then it is called a Generic subdomain. These types of subdomains are important for business success, but they are not of primary importance. It is the Core domain that must be implemented perfectly, as it provides a business advantage.
</p>
</div>
</div>
<div id="outline-container-orgf4e7f83" class="outline-3">
<h3 id="orgf4e7f83"><span class="section-number-3">11.6</span> Problem space</h3>
<div class="outline-text-3" id="text-11-6">
<p>
The problem space is a part of the subject area that is necessary to create the core meaning. It is a combination of the core meaning and sub-domains that this core should use.
</p>
</div>
</div>
<div id="outline-container-org5c81d77" class="outline-3">
<h3 id="org5c81d77"><span class="section-number-3">11.7</span> Solution space</h3>
<div class="outline-text-3" id="text-11-7">
<p>
The solution space is one or several limited contexts, a set of specific software models. The developed limited context is a specific solution, a representation of implementation.
</p>
</div>
</div>
<div id="outline-container-org37ff1a5" class="outline-3">
<h3 id="org37ff1a5"><span class="section-number-3">11.8</span> Red book example</h3>
<div class="outline-text-3" id="text-11-8">
<p>
In Vernon’s book, an example is given of a core concept for a small retail company that operates online. Any online store can improve its position by using a forecasting mechanism that analyzes sales history and inventory data to predict demand and determine optimal inventory levels. (The company should not waste money on products that have no demand and take up additional warehouse space.) It is this core concept that makes the organization much more competitive, able to quickly identify profitable deals and guarantee the necessary inventory levels. The problem space consists of the core concept and subdomains related to procurement and inventory.
</p>
</div>
</div>
<div id="outline-container-org29525a3" class="outline-3">
<h3 id="org29525a3"><span class="section-number-3">11.9</span> Sources</h3>
<div class="outline-text-3" id="text-11-9">
<p>
<a href="https://levelup.gitconnected.com/domain-and-core-domain-in-ddd-c49733fa8c74">https://levelup.gitconnected.com/domain-and-core-domain-in-ddd-c49733fa8c74</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org7dffaf8" class="outline-2">
<h2 id="org7dffaf8"><span class="section-number-2">12</span> Generic subdomains</h2>
</div>
<div id="outline-container-org62938a8" class="outline-2">
<h2 id="org62938a8"><span class="section-number-2">13</span> Bounded Context</h2>
<div class="outline-text-2" id="text-13">
<p>
A bounded context is simply the boundary within a domain where a particular domain model applies.
</p>
</div>
<div id="outline-container-orgbf97984" class="outline-3">
<h3 id="orgbf97984"><span class="section-number-3">13.1</span> Open Host Service</h3>
<div class="outline-text-3" id="text-13-1">
<p>
The idea of Open Host Service is that a subsystem defines a formal protocol (API) for other subsystems to communicate with it.
</p>
</div>
</div>
<div id="outline-container-orgd72e985" class="outline-3">
<h3 id="orgd72e985"><span class="section-number-3">13.2</span> Published Language</h3>
<div class="outline-text-3" id="text-13-2">
<p>
It extends Open Host Service by publishing the API in a form that other teams can use to write clients.
</p>
</div>
</div>
<div id="outline-container-org3b994e6" class="outline-3">
<h3 id="org3b994e6"><span class="section-number-3">13.3</span> Sources</h3>
<div class="outline-text-3" id="text-13-3">
<ul class="org-ul">
<li><a href="https://learn.microsoft.com/en-us/azure/architecture/microservices/model/domain-analysis">https://learn.microsoft.com/en-us/azure/architecture/microservices/model/domain-analysis</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org72af20e" class="outline-2">
<h2 id="org72af20e"><span class="section-number-2">14</span> Continuous Integration</h2>
<div class="outline-text-2" id="text-14">
<p>
When a number of people are working in the same bounded context there is a strong tendency for the model to fragment. The bigger the team, the bigger the problem, but as few as three or four people can encounter serious problems. Yet breaking down the system into ever-smaller contexts eventually loses a valuable level of integration and coherency.
</p>

<p>
Therefore:
</p>

<p>
Institute a process of merging all code and other implementation artifacts frequently, with automated tests to flag fragmentation quickly. Relentlessly exercise the ubiquitous language to hammer out a shared view of the model as the concepts evolve in different people's heads.
</p>
</div>
<div id="outline-container-orgb3d5e58" class="outline-3">
<h3 id="orgb3d5e58"><span class="section-number-3">14.1</span> Sources:</h3>
<div class="outline-text-3" id="text-14-1">
<ul class="org-ul">
<li><a href="http://ddd.fed.wiki.org/view/continuous-integration">http://ddd.fed.wiki.org/view/continuous-integration</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org3d708fc" class="outline-2">
<h2 id="org3d708fc"><span class="section-number-2">15</span> Context Map</h2>
<div class="outline-text-2" id="text-15">
<p>
Context Maps describe the contact between bounded contexts and teams with a collection of patterns. There are nine context map patterns and three different team relationships. The context map patterns describe a variety of perspectives like service provisioning, model propagation or governance aspects. This diversity of perspectives enables you to get a holistic overview of team and bounded context relationships.
</p>

<p>
Context Maps can be used to analyze existing systems or application landscapes, but they are also suitable for upfront design considerations.
</p>
</div>
<div id="outline-container-org81a3ba8" class="outline-3">
<h3 id="org81a3ba8"><span class="section-number-3">15.1</span> Team Relationships</h3>
<div class="outline-text-3" id="text-15-1">
<ul class="org-ul">
<li>Mutually Dependent</li>
<li>Upstream Downstream</li>
<li>Free</li>
</ul>
</div>
</div>
<div id="outline-container-orgdd8ef72" class="outline-3">
<h3 id="orgdd8ef72"><span class="section-number-3">15.2</span> Context Map patterns</h3>
<div class="outline-text-3" id="text-15-2">
<ul class="org-ul">
<li>Open-host Service</li>
<li>Conformist</li>
<li>Anticorruption Layer</li>
<li>Shared Kernel</li>
<li>Partnership</li>
<li>Customer / Supplier development</li>
<li>Published language</li>
<li>Separate Ways</li>
<li>Big Ball Of Mud</li>
</ul>
</div>
</div>
<div id="outline-container-org9897225" class="outline-3">
<h3 id="org9897225"><span class="section-number-3">15.3</span> Sources</h3>
<div class="outline-text-3" id="text-15-3">
<ul class="org-ul">
<li><a href="https://github.com/ddd-crew/context-mappinghttps://github.com/ddd-crew/context-mapping">https://github.com/ddd-crew/context-mappinghttps://github.com/ddd-crew/context-mapping</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org7497e97" class="outline-2">
<h2 id="org7497e97"><span class="section-number-2">16</span> Shared Kernel</h2>
</div>
<div id="outline-container-org230ea02" class="outline-2">
<h2 id="org230ea02"><span class="section-number-2">17</span> Customer / Supplier</h2>
</div>
<div id="outline-container-org428c165" class="outline-2">
<h2 id="org428c165"><span class="section-number-2">18</span> Conformist</h2>
</div>
<div id="outline-container-org3fe615a" class="outline-2">
<h2 id="org3fe615a"><span class="section-number-2">19</span> Open Host Service</h2>
</div>
<div id="outline-container-org0e29e4e" class="outline-2">
<h2 id="org0e29e4e"><span class="section-number-2">20</span> Published Language</h2>
</div>
<div id="outline-container-org3fad7f2" class="outline-2">
<h2 id="org3fad7f2"><span class="section-number-2">21</span> Separate Ways</h2>
</div>
<div id="outline-container-org64b74ca" class="outline-2">
<h2 id="org64b74ca"><span class="section-number-2">22</span> Anti-Corruption Layer</h2>
</div>
<div id="outline-container-org48f2f6a" class="outline-2">
<h2 id="org48f2f6a"><span class="section-number-2">23</span> Big Ball of Mud</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: mikel</p>
<p class="date">Created: 2023-05-25 jue 17:02</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
